{
  "backend/main.mo": "Motoko actor defining a CRUD API for financial resources, storing them in a Map keyed by ID with support for add, get, update, delete, and category-filtered queries.",
  "feature_evidence.json": "Feature evidence report confirming that all 6 loan offer display names in loanOffersData.ts have been updated to real lender brand names with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary of all frontend source files, describing the purpose and recent changes of each component, page, hook, and data file.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark themes covering background, foreground, primary, secondary, accent, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the app with meta tags for SEO and Open Graph, Google Fonts preconnect for Inter and Merriweather, and a root div for the React app.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with '/' and '/category/$category' routes, wrapped in ErrorBoundary and LeadCaptureProvider.",
  "frontend/src/components/DiscussionSection.tsx": "Section component that renders a category-specific editorial discussion paragraph in a pastel lavender box followed by a grid of ReviewCard components.",
  "frontend/src/components/ErrorBoundary.tsx": "React class-based ErrorBoundary that catches rendering errors and displays a styled fallback UI with a refresh button.",
  "frontend/src/components/Footer.tsx": "Site footer with brand logo, category navigation links, and a disclaimer section, styled with brand-deep background and pastel-rose heart icon.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop nav links, and a collapsible mobile menu, each nav item navigating to a finance category route.",
  "frontend/src/components/LeadCaptureModal.tsx": "Full-screen modal form that collects user contact/address details, validates them, and submits lead data via the LeadCaptureContext.",
  "frontend/src/components/LoanOfferCard.tsx": "Card displaying a single loan offer with lender name, APR, badge, and CTA link; shows a blurred lock overlay until lead data is captured.",
  "frontend/src/components/LoanOffersSection.tsx": "Section that renders a grid of LoanOfferCards for a given ResourceCategory, with a lock notice shown when the lead has not yet been captured.",
  "frontend/src/components/ResourceCard.tsx": "Card component displaying a financial resource's title, description, category badge, and an optional external link.",
  "frontend/src/components/ReviewCard.tsx": "Simple card showing a user review with a star rating, quote text, and avatar initial.",
  "frontend/src/components/TopicCard.tsx": "Clickable card representing a finance topic/category that navigates to the category page, showing an icon, label, description, and resource count.",
  "frontend/src/components/TopLoanOffersBanner.tsx": "Full-width banner section showcasing top loan offers in a grid; displays blurred placeholder cards with a lock overlay until the lead is captured.",
  "frontend/src/context/LeadCaptureContext.tsx": "Provides a React context for capturing and persisting lead form data (name, email, address, etc.) to sessionStorage, exposing `isLeadCaptured`, `leadData`, and `submitLead` via the `useLeadCapture` hook.",
  "frontend/src/data/loanOffersData.ts": "Defines a `LoanOffer` interface and exports a static map of sponsored/partner loan offers keyed by `ResourceCategory` (budgeting, saving, investing, taxes, etc.).",
  "frontend/src/data/reviewsData.ts": "Exports static user review data and discussion text for each `ResourceCategory`, each entry containing a discussion paragraph and an array of rated user reviews.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via `AuthClient`, providing a React context and `InternetIdentityProvider` component that expose login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks (`useGetAllResources`, `useGetResourcesByCategory`, `useGetResource`, `useAddResource`, `useDeleteResource`) for CRUD operations against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS and defines a pastel finance-themed design token system (CSS custom properties) for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrappers around the root `App` component.",
  "frontend/src/pages/CategoryPage.tsx": "Displays a finance category page with a hero section, resource cards, discussion section, and loan offers, using category metadata (icons, tips, descriptions) and gating affiliate links behind a lead capture modal.",
  "frontend/src/pages/HomePage.tsx": "Renders the main landing page with a hero section, topic cards for 7 finance categories, recent resources, stats, highlight reviews, and a lead capture modal gating affiliate content.",
  "frontend/src/utils/affiliateUrlBuilder.ts": "Exports a utility function that replaces [firstName], [lastName], and [email] token placeholders in affiliate URLs with URL-encoded values from submitted lead form data.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom brand/pastel color tokens using OKLCH variables, extended typography/shadow/font settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current project state (version 13) for the 'US Finance Helps' loan landing page, documenting architectural notes, known issues (load error, missing affiliate links), and a list of implemented features."
}