{
  "backend/main.mo": "Motoko actor defining a financial resource registry with CRUD operations (add, get, update, delete) and category-based filtering using an in-memory Map.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing their purpose and recent changes.",
  "frontend/index.css": "Tailwind base CSS defining OKLCH-based CSS custom property tokens for light and dark themes including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "HTML entry point for the 'US Finance Helps' app with SEO meta tags, Open Graph/Twitter card tags, and Google Fonts preconnect for Inter and Merriweather.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with '/' and '/category/$category' routes, wrapped in ErrorBoundary and LeadCaptureProvider.",
  "frontend/src/components/DiscussionSection.tsx": "Section component rendering a category-specific editorial discussion paragraph in a pastel lavender box followed by a grid of ReviewCard components.",
  "frontend/src/components/ErrorBoundary.tsx": "React class-based ErrorBoundary that catches rendering errors and displays a styled fallback UI with a refresh button.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, category navigation links, and a disclaimer section, styled with brand-deep background and pastel accents.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop category navigation, and a mobile hamburger menu, styled using the brand-deep color token.",
  "frontend/src/components/LeadCaptureModal.tsx": "A modal form that collects user contact and address details (name, email, phone, address, zip) with validation, then calls `submitLead` from LeadCaptureContext to unlock loan offers.",
  "frontend/src/components/LoanOfferCard.tsx": "Displays a single loan offer card with lender name, APR, badge, and CTA link; shows a blurred locked state with an overlay when the lead has not yet been captured.",
  "frontend/src/components/LoanOffersSection.tsx": "Renders a grid of LoanOfferCards for a given resource category, with a lock-prompt banner shown when the lead has not been captured.",
  "frontend/src/components/ResourceCard.tsx": "Displays a single financial resource with its title, description, category badge, and an optional external link.",
  "frontend/src/components/ReviewCard.tsx": "Renders a user review card with a star rating, review text, and reviewer avatar initial and name.",
  "frontend/src/components/TopicCard.tsx": "A clickable card representing a financial topic/category that navigates to the category page, showing an icon, label, description, and resource count.",
  "frontend/src/components/TopLoanOffersBanner.tsx": "A full-width banner section showcasing top loan offers; displays blurred placeholder cards with a lock overlay until the lead is captured, then shows real offer cards with affiliate links.",
  "frontend/src/context/LeadCaptureContext.tsx": "React context that manages lead capture state, persisting submitted LeadData to sessionStorage and exposing `isLeadCaptured`, `leadData`, and `submitLead` to consumers.",
  "frontend/src/data/loanOffersData.ts": "Defines the LoanOffer interface and exports a record of sponsored/partner loan offer objects keyed by ResourceCategory (budgeting, saving, investing, taxes, etc.), each with lender details, APR, CTA text, and affiliate URLs.",
  "frontend/src/data/reviewsData.ts": "Defines Review and CategoryReviewData interfaces and exports static review content (discussion text and user reviews) keyed by ResourceCategory for use in category pages.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, login/logout, and identity state persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks (useGetAllResources, useGetResourcesByCategory, useGetResource, useAddResource, useDeleteResource) that wrap ICP backend actor calls for CRUD operations on resources.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet that defines a pastel finance-themed design system with CSS custom properties for light and dark modes, including brand colors, chart colors, and sidebar tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/CategoryPage.tsx": "Displays a finance category page with a hero section, tips, searchable resource cards, a discussion section, and a loan offers section; affiliate links are gated behind a lead capture modal.",
  "frontend/src/pages/HomePage.tsx": "Renders the main landing page with a hero, stats, topic cards for 7 finance categories, recent resources, highlight reviews, and a top loan offers banner; shows a lead capture modal until the form is submitted.",
  "frontend/src/utils/affiliateUrlBuilder.ts": "Exports a utility function that replaces [firstName], [lastName], and [email] token placeholders in an affiliate URL with URL-encoded values from the captured lead data.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom brand/pastel color tokens using OKLCH variables, extended typography/shadow/animation settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current project state (version 15) for the 'US Finance Helps' loan landing page, documenting architecture, existing features, known issues, and affiliate offer details."
}